/** Перебор свойств объекта
 *
 * 1. Создайте функцию "sumObjectValues", которая будет суммировать
 * все значения свойств, которые являются числами.
 *
 * 2. Сумму чисел необходимо вернуть из функции
 *
 * 3. Убедитесь, что итерация выполняется только
 * по собственным свойствам объекта
 */











































/** Перебор свойств объекта
 *
 * 1. Создайте функцию "sumObjectValues", которая будет суммировать
 * все значения свойств, которые являются числами.
 *
 * 2. Сумму чисел необходимо вернуть из функции
 *
 * 3. Убедитесь, что итерация выполняется только
 * по собственным свойствам объекта
 */




// const objectWithNumbers = {
//   a: 10,
//   b: 20,
//   c: 'string',
//   d: 12,
// }

// function sumObjectValues(numbers) {
//   let sum = 0

//   Object.keys(numbers).forEach((key) => {
//     if (typeof numbers[key] === 'number') {
//       sum += numbers[key]
//     }
//   })

//   return sum
// }

// const result = sumObjectValues(objectWithNumbers)
// console.log(result)
//  /* 42 */
